Конфигурация/Documents/Маржа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Маржа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеннаяОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Итоговая сумма, рассчитывается автоматически по данным табличной части</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РынокСПФИ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Инструменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:DocumentRef.СделкаСПФИ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОперацийПриВводеВыводеДенежныхСредств</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПереводовДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БрокерскиеКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОперацииСЦеннымиБумагами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОперацииСЦеннымиБумагами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставкиПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеклассификацияАктивовЕПС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоставкаЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеЦеннойБумагиСУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/Маржа/Ext/ObjectModule.bsl
Процедура СформироватьДвиженияПоЗадолженности()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МаржаИнструменты.Ссылка.Дата КАК Период,
		|	МаржаИнструменты.Ссылка КАК Основание,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Сумма > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВариационнойМарже) КАК ВидЗадолженности,
		|	МаржаИнструменты.Ссылка.Организация КАК Организация,
		|	МаржаИнструменты.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МаржаИнструменты.Ссылка.ВалютаОплаты КАК Валюта,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Сумма > 0
		|			ТОГДА МаржаИнструменты.Сумма
		|		ИНАЧЕ -МаржаИнструменты.Сумма
		|	КОНЕЦ КАК Сумма,
		|	МаржаИнструменты.Ссылка.ОтложеннаяОплата КАК ОтложеннаяОплата
		|ПОМЕСТИТЬ ВТ_ВариационнаяМаржа
		|ИЗ
		|	Документ.Маржа.Инструменты КАК МаржаИнструменты
		|ГДЕ
		|	МаржаИнструменты.Ссылка = &Ссылка
		|	И МаржаИнструменты.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаржаИнструменты.Ссылка.Дата,
		|	МаржаИнструменты.Ссылка,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Процент > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВариационнойМарже),
		|	МаржаИнструменты.Ссылка.Организация,
		|	МаржаИнструменты.Ссылка.СчетДоверительногоУправления,
		|	МаржаИнструменты.Ссылка.ВалютаОплаты,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Процент > 0
		|			ТОГДА МаржаИнструменты.Процент
		|		ИНАЧЕ -МаржаИнструменты.Процент
		|	КОНЕЦ,
		|	МаржаИнструменты.Ссылка.ОтложеннаяОплата
		|ИЗ
		|	Документ.Маржа.Инструменты КАК МаржаИнструменты
		|ГДЕ
		|	МаржаИнструменты.Ссылка = &Ссылка
		|	И МаржаИнструменты.Процент <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_ВариационнаяМаржа.Период КАК Период,
		|	ВТ_ВариационнаяМаржа.Основание КАК Основание,
		|	ВТ_ВариационнаяМаржа.ТипЗадолженности КАК ТипЗадолженности,
		|	ВТ_ВариационнаяМаржа.ВидЗадолженности КАК ВидЗадолженности,
		|	ВТ_ВариационнаяМаржа.Организация КАК Организация,
		|	ВТ_ВариационнаяМаржа.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВТ_ВариационнаяМаржа.Валюта КАК Валюта,
		|	ВТ_ВариационнаяМаржа.Сумма КАК Сумма,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения
		|ИЗ
		|	ВТ_ВариационнаяМаржа КАК ВТ_ВариационнаяМаржа
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ВариационнаяМаржа.Период,
		|	ВТ_ВариационнаяМаржа.Основание,
		|	ВТ_ВариационнаяМаржа.ТипЗадолженности,
		|	ВТ_ВариационнаяМаржа.ВидЗадолженности,
		|	ВТ_ВариационнаяМаржа.Организация,
		|	ВТ_ВариационнаяМаржа.СчетДоверительногоУправления,
		|	ВТ_ВариационнаяМаржа.Валюта,
		|	ВТ_ВариационнаяМаржа.Сумма,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|ИЗ
		|	ВТ_ВариационнаяМаржа КАК ВТ_ВариационнаяМаржа
		|ГДЕ
		|	НЕ ВТ_ВариационнаяМаржа.ОтложеннаяОплата";
				
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект.Движения.ЗадолженностиПоДенежнымСредствам.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры // СформироватьДвиженияПоЗадолженности

Процедура СформироватьДвиженияДенежныхСредств()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МаржаИнструменты.Ссылка.Дата КАК Период,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Сумма > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	МаржаИнструменты.Ссылка.Организация КАК Организация,
		|	МаржаИнструменты.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МаржаИнструменты.Ссылка.Брокер КАК Брокер,
		|	МаржаИнструменты.Ссылка.МестоХранения КАК МестоХранения,
		|	МаржаИнструменты.Ссылка.РасчетныйСчет КАК РасчетныйСчет,
		|	МаржаИнструменты.Ссылка.ВалютаОплаты КАК Валюта,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Сумма > 0
		|			ТОГДА МаржаИнструменты.Сумма
		|		ИНАЧЕ -МаржаИнструменты.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа) КАК ВидДвиженияДенежныхСредств
		|ИЗ
		|	Документ.Маржа.Инструменты КАК МаржаИнструменты
		|ГДЕ
		|	МаржаИнструменты.Ссылка = &Ссылка
		|	И МаржаИнструменты.Сумма <> 0
		|	И НЕ МаржаИнструменты.Ссылка.ОтложеннаяОплата
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	МаржаИнструменты.Ссылка.Дата,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Процент > 0
		|			ТОГДА ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	КОНЕЦ,
		|	МаржаИнструменты.Ссылка.Организация,
		|	МаржаИнструменты.Ссылка.СчетДоверительногоУправления,
		|	МаржаИнструменты.Ссылка.Брокер,
		|	МаржаИнструменты.Ссылка.МестоХранения,
		|	МаржаИнструменты.Ссылка.РасчетныйСчет,
		|	МаржаИнструменты.Ссылка.ВалютаОплаты,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Процент > 0
		|			ТОГДА МаржаИнструменты.Процент
		|		ИНАЧЕ -МаржаИнструменты.Процент
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийДенежныхСредств.ВариационнаяМаржа)
		|ИЗ
		|	Документ.Маржа.Инструменты КАК МаржаИнструменты
		|ГДЕ
		|	МаржаИнструменты.Ссылка = &Ссылка
		|	И МаржаИнструменты.Процент <> 0
		|	И НЕ МаржаИнструменты.Ссылка.ОтложеннаяОплата";
				
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОстаткиДенежныхСредств.Добавить(), Выборка);
	КонецЦикла;
	
КонецПроцедуры // СформироватьДвиженияДенежныхСредств

Процедура СформироватьДвиженияПоОперациямСЦеннымиБумагами()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВариационнаяМаржа.Ссылка КАК Операция,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Сумма > 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход)
		|	КОНЕЦ КАК ВидДвижения,
		|	ВариационнаяМаржа.Организация,
		|	ВариационнаяМаржа.СчетДоверительногоУправления,
		|	ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Фьючерсы) КАК Рынок,
		|	ВариационнаяМаржа.ВалютаОплаты КАК Валюта,
		|	МаржаИнструменты.Инструмент КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА МаржаИнструменты.Сумма > 0
		|			ТОГДА МаржаИнструменты.Сумма
		|		ИНАЧЕ -МаржаИнструменты.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВариационнаяМаржа.Дата КАК ДатаОперации
		|ИЗ
		|	Документ.Маржа КАК ВариационнаяМаржа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Маржа.Инструменты КАК МаржаИнструменты
		|		ПО (МаржаИнструменты.Ссылка = ВариационнаяМаржа.Ссылка)
		|ГДЕ
		|	ВариационнаяМаржа.Ссылка = &Ссылка
		|	И МаржаИнструменты.Сумма <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	МаржаИнструменты.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Движения.ОперацииСЦеннымиБумагами.Добавить(), Выборка);
	КонецЦикла;
		
КонецПроцедуры // СформироватьДвиженияПоОперациямСЦеннымиБумагами

Процедура УстановитьБлокировки()

	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	// остатки д/с
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиДенежныхСредств");
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Брокер",                       ЭтотОбъект.Брокер);
	ЭлементБлокировкиДанных.УстановитьЗначение("МестоХранения",                ЭтотОбъект.МестоХранения);
	ЭлементБлокировкиДанных.УстановитьЗначение("РасчетныйСчет",                ЭтотОбъект.РасчетныйСчет);
	ЭлементБлокировкиДанных.УстановитьЗначение("Валюта",                       ЭтотОбъект.ВалютаОплаты);
	
	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОперацииСЦеннымиБумагами.Записывать         = НЕ ЭтотОбъект.РынокСПФИ;
	Движения.ОстаткиДенежныхСредств.Записывать           = Истина;
	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;

	СформироватьДвиженияПоЗадолженности();
	СформироватьДвиженияДенежныхСредств();
	Если НЕ ЭтотОбъект.РынокСПФИ Тогда
		СформироватьДвиженияПоОперациямСЦеннымиБумагами();
	КонецЕсли;
	
	Движения.Записать();
	
	Если НЕ ЭтотОбъект.ОтложеннаяОплата И ЭтотОбъект.Инструменты.Итог("Сумма") < 0 Тогда
		РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиДенежныхСредств(ЭтотОбъект, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкуДвиженияДС(ПараметрыПроводки)

	//СПФИ, Контрагент, СчетДС, ВидСубконтоДС, СубконтоДС, СуммаДвиженияДС, Валюта, КоррСчет, ВидДвиженияДенежныхСредств, Описание
	
	Если ПараметрыПроводки.СуммаДвиженияДС > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		Проводка.СчетДт = ПараметрыПроводки.СчетДС;
		Проводка.СубконтоДт[ПараметрыПроводки.ВидСубконтоДС] = ПараметрыПроводки.СубконтоДС;
		Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = ПараметрыПроводки.ВидДвиженияДенежныхСредств;
						
		Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаДвиженияДС;
		
		
		Проводка.СчетКт = ПараметрыПроводки.КоррСчет;
		Проводка.СубконтоКт.Контрагенты = ПараметрыПроводки.Контрагент;
		Проводка.СубконтоКт.ОснованиеРасчетов = ПараметрыПроводки.СПФИ;
		
		Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.СуммаДвиженияДС;
		
		
	ИначеЕсли ПараметрыПроводки.СуммаДвиженияДС < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, -ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		Проводка.СчетДт = ПараметрыПроводки.КоррСчет;
		Проводка.СубконтоДт.Контрагенты = ПараметрыПроводки.Контрагент;
		Проводка.СубконтоДт.ОснованиеРасчетов = ПараметрыПроводки.СПФИ;
		
		Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаДт = -ПараметрыПроводки.СуммаДвиженияДС;
		
		
		Проводка.СчетКт = ПараметрыПроводки.СчетДС;
		Проводка.СубконтоКт[ПараметрыПроводки.ВидСубконтоДС] = ПараметрыПроводки.СубконтоДС;
		Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = ПараметрыПроводки.ВидДвиженияДенежныхСредств;
						
		Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
		Проводка.ВалютнаяСуммаКт = -ПараметрыПроводки.СуммаДвиженияДС;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПроведениеПоРегиструЕПС(ВидУчета, Отказ) Экспорт

	Движения.ЕдиныйБухгалтерскийУчет.Записывать = Истина;
	
	БиржаКонтрагент = ОбщегоНазначения.ПолучитьИменованныйОбъект("Биржа_ММВБ").ЮрФизЛицо;
	
	Если ЭтотОбъект.РынокСПФИ Тогда
		
		УчетныйАктивЕПС = Справочники.УчетныеАктивыЕПС.ПроизводныеФинансовыеИнструментыОснованныеНаПроцентныхДоговорах;
		
		МассивУчетныхАктивов = Новый Массив;
		МассивУчетныхАктивов.Добавить(УчетныйАктивЕПС);
		
		МассивСПФИ = Новый Массив;
	
	КонецЕсли;
	
	
	Для каждого СтрокаИнструменты Из ЭтотОбъект.Инструменты Цикл
		
		Если ЭтотОбъект.РынокСПФИ Тогда
			
			МассивСПФИ.Добавить(СтрокаИнструменты.Инструмент);
			
			СчетДС = ПланыСчетов.Единый.РасчетыСБрокерами02; // пока предполагаем только через брокера
			ВидСубконтоДС = ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания;
			СубконтоДС = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
			СПФИ = СтрокаИнструменты.Инструмент;
			Контрагент = СтрокаИнструменты.Инструмент.Контрагент;
			Валюта = ЭтотОбъект.ВалютаОплаты;
			ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ДепозитнаяМаржа;
			
			Если СтрокаИнструменты.Сумма > 0 Тогда
				
				СуммаДвиженияДС = СтрокаИнструменты.Сумма;
				
				// 52601 - 71509
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Начислена ДМ");
				
				Проводка.СчетДт = ПланыСчетов.Единый.ПроизводныеФинансовыеИнструменты01;
				Проводка.СубконтоДт.ЦенныеБумаги = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;
				
				
				Проводка.СчетКт = УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивЕПС.АналитикаДоходовОтПереоценки;
				Проводка.СубконтоКт.ЦенныеБумаги = СПФИ;
				
				
				// 61601 - 52601
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Требования по уплате ДМ");
				
				Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.ПроизводныеФинансовыеИнструменты01;
				Проводка.СубконтоКт.ЦенныеБумаги = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				

				// 47408 - 61601
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Требования по уплате ДМ");
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;

				
				// 30602 - 47408
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Получена ДМ");
				
				Проводка.СчетДт = СчетДС;
				Проводка.СубконтоДт[ВидСубконтоДС] = СубконтоДС;
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредств;
								
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
			ИначеЕсли СтрокаИнструменты.Сумма < 0 Тогда
				
				СуммаДвиженияДС = -СтрокаИнструменты.Сумма;
				
				// 71510 - 52602
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Начислена ДМ");
				
				Проводка.СчетДт = УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = УчетныйАктивЕПС.АналитикаРасходовОтПереоценки;
				Проводка.СубконтоДт.ЦенныеБумаги = СПФИ;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.ПроизводныеФинансовыеИнструменты02;
				Проводка.СубконтоКт.ЦенныеБумаги = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
				
				// 52602 - 61601
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Обязательство по уплате ДМ");
				
				Проводка.СчетДт = ПланыСчетов.Единый.ПроизводныеФинансовыеИнструменты02;
				Проводка.СубконтоДт.ЦенныеБумаги = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;

				
				Проводка.СчетКт = ПланыСчетов.Единый.ВспомогательныеСчета01;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				
				// 61601 - 47407
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Обязательство по уплате ДМ");
				
				Проводка.СчетДт = ПланыСчетов.Единый.ВспомогательныеСчета01;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;				
				
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
				
				// 47407 - 30602
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Уплачена ДМ");
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты07;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;

				
				Проводка.СчетКт = СчетДС;
				Проводка.СубконтоКт[ВидСубконтоДС] = СубконтоДС;
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредств;
								
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
			КонецЕсли;
			
			
			// %ДМ
			
			Если СтрокаИнструменты.Процент > 0 Тогда 
				
				СуммаДвиженияДС = СтрокаИнструменты.Процент;
				
				// 47423 - 71001
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Начисление % на ДМ к получению");
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.ПроцентныеДоходы01;
				Проводка.СубконтоКт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУПроцентныхДоходовПоСредствамПредоставленнымКонтрагенту(Контрагент, ЭтотОбъект.Дата);
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;

				
				// 47408 - 47423
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Расчеты по % на ДМ к получению");
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;

				
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты23;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
				

				// 30602 - 47408
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Оплата по % на ДМ к получению");
				
				Проводка.СчетДт = СчетДС;
				Проводка.СубконтоДт[ВидСубконтоДС] = СубконтоДС;
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредств;
								
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты08;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
			ИначеЕсли СтрокаИнструменты.Процент < 0 Тогда
				
				СуммаДвиженияДС = -СтрокаИнструменты.Процент;
				
				// 71101 - 47423
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Начисление % на ДМ к выплате");
				
				Проводка.СчетДт = ПланыСчетов.Единый.ПроцентныеРасходы01;
				Проводка.СубконтоДт.ГруппыФинансовогоУчетаДоходовРасходов = БухгалтерскийУчетЕПС.ОпределитьГФУПроцентныхРасходовПоПривлеченнымСредствам(Контрагент, ЭтотОбъект.Дата);
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				
				
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты23;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;

				
				// 47423 - 47407
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Расчеты по % на ДМ к выплате");
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты23;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;

				
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
				Проводка.СубконтоКт.Контрагенты = Контрагент;
				Проводка.СубконтоКт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				

				// 47407 - 30602
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения.ЕдиныйБухгалтерскийУчет, СуммаДвиженияДС, "Оплата по % на ДМ к выплате");
				
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				Проводка.СубконтоДт.Контрагенты = Контрагент;
				Проводка.СубконтоДт.ОснованиеРасчетов = СПФИ;
				
				Проводка.ВалютаДт = Валюта;
				Проводка.ВалютнаяСуммаДт = СуммаДвиженияДС;

				
				Проводка.СчетКт = СчетДС;
				Проводка.СубконтоКт[ВидСубконтоДС] = СубконтоДС;
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = ВидДвиженияДенежныхСредств;
								
				Проводка.ВалютаКт = Валюта;
				Проводка.ВалютнаяСуммаКт = СуммаДвиженияДС;
				
			КонецЕсли;
			
		Иначе // фьючерсы

			СуммаОперации = РаботаСВалютами.ПолучитьСуммуВВалютеУчета(СтрокаИнструменты.Сумма, ЭтотОбъект.ВалютаОплаты, ЭтотОбъект.Организация, ЭтотОбъект.Дата);
			
			Если СуммаОперации > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, СуммаОперации, "Вариационная маржа");
				
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.РасчетыСБрокерами02;
				Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
				Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВариационнаяМаржа;
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаДт = СтрокаИнструменты.Сумма;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.Расчеты07;
				Проводка.СубконтоКт.Контрагенты = БиржаКонтрагент;
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаКт = СтрокаИнструменты.Сумма;

			Иначе
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения.ЕдиныйБухгалтерскийУчет, -СуммаОперации, "Вариационная маржа");
			
				// дебет
				Проводка.СчетДт = ПланыСчетов.Единый.Расчеты08;
				Проводка.СубконтоДт.Контрагенты = БиржаКонтрагент;
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаДт = -СтрокаИнструменты.Сумма;
				
				// кредит
				Проводка.СчетКт = ПланыСчетов.Единый.РасчетыСБрокерами02;
				Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
				Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВариационнаяМаржа;
				Проводка.ВалютаКт = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаКт = -СтрокаИнструменты.Сумма;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	БухгалтерскийУчетЕПС.ОбработатьДвиженияДокументаПоПарнымСчетам(ЭтотОбъект, Отказ);
	
	Если ЭтотОбъект.РынокСПФИ Тогда
		БухгалтерскийУчетЕПС.ЗакрытьПарныеСчетаДоходовРасходов(ЭтотОбъект, МассивУчетныхАктивов, Истина, Ложь, МассивСПФИ, Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводки)

	//СПФИ, УчетныйРегистр, Контрагент, СчетДС, СубконтоДС, СуммаДвиженияДС, Валюта, КоррСчет, ВидДвиженияДенежныхСредств, Описание
	
	Если ПараметрыПроводки.СуммаДвиженияДС > 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[ПараметрыПроводки.УчетныйРегистр], ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		СчетУчетаДС = ПараметрыПроводки.СчетДС;
		
		Проводка.СчетДт = СчетУчетаДС;
		
		ЕстьБрокер							= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено;
		ЕстьДоговорыБрокерскогоОбслуживания	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено;
		ЕстьВидДвиженияДС					= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено;
		ЕстьРасчетныйСчет                	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено;
		ЕстьВалютныйУчетДС					= СчетУчетаДС.Валютный;
		
		Если ЕстьБрокер Тогда
			Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
		КонецЕсли;
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = ПараметрыПроводки.СубконтоДС;
		КонецЕсли;	
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоДт.ВидДвиженияДенежныхСредств 	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссия;
		КонецЕсли;	
		
		Если ЕстьВалютныйУчетДС Тогда
			Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаДт = ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;	
		
		Проводка.СчетКт = ПараметрыПроводки.КоррСчет;
		
		ЕстьКорКонтрагент	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено;
		ЕстьКорСделка	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено;
		
		ЕстьКорВалютныйУчетДС	= ПараметрыПроводки.КоррСчет.Валютный;
		
		Если ЕстьКорКонтрагент Тогда
			Проводка.СубконтоКт.Контрагенты = ПараметрыПроводки.Контрагент;
		КонецЕсли;	
		
		Если ЕстьКорСделка Тогда
			Проводка.СубконтоКт.Сделка = ПараметрыПроводки.СПФИ;
		КонецЕсли;	
		
		Если ЕстьКорВалютныйУчетДС Тогда
			Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаКт = ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;
		
	ИначеЕсли ПараметрыПроводки.СуммаДвиженияДС < 0 Тогда
		
		Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, ЭтотОбъект.Движения[ПараметрыПроводки.УчетныйРегистр], -ПараметрыПроводки.СуммаДвиженияДС, ПараметрыПроводки.Описание);
		
		Проводка.СчетДт = ПараметрыПроводки.КоррСчет;
		
		ЕстьКорКонтрагент	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты) <> Неопределено;
		ЕстьКорСделка	= ПараметрыПроводки.КоррСчет.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.Сделка) <> Неопределено;
		
		ЕстьКорВалютныйУчетДС	= ПараметрыПроводки.КоррСчет.Валютный;
		
		Если ЕстьКорКонтрагент Тогда
			Проводка.СубконтоДт.Контрагенты = ПараметрыПроводки.Контрагент;
		КонецЕсли;	
		
		Если ЕстьКорСделка Тогда
			Проводка.СубконтоДт.Сделка = ПараметрыПроводки.СПФИ;
		КонецЕсли;	
		
		Если ЕстьКорВалютныйУчетДС Тогда
			Проводка.ВалютаДт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаДт = -ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;
		
		СчетУчетаДС = ПараметрыПроводки.СчетДС;
		
		Проводка.СчетКт = СчетУчетаДС;
		
		ЕстьБрокер							= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено;
		ЕстьДоговорыБрокерскогоОбслуживания	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено;
		ЕстьВидДвиженияДС					= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено;
		ЕстьРасчетныйСчет                	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено;
		ЕстьВалютныйУчетДС					= СчетУчетаДС.Валютный;
		
		Если ЕстьБрокер Тогда
			Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
		КонецЕсли;
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = ПараметрыПроводки.СубконтоДС;
		КонецЕсли;	
		
		Если ЕстьВидДвиженияДС Тогда
			Проводка.СубконтоКт.ВидДвиженияДенежныхСредств 	= Справочники.ВидыДвиженияДенежныхСредств.ТорговаяКомиссия;
		КонецЕсли;	
		
		Если ЕстьВалютныйУчетДС Тогда
			Проводка.ВалютаКт = ПараметрыПроводки.Валюта;
			Проводка.ВалютнаяСуммаКт = -ПараметрыПроводки.СуммаДвиженияДС;
		КонецЕсли;	
		
	КонецЕсли;

КонецПроцедуры

Функция ОпределитьNPV(СВОП, Период);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтоимостьСПФИ.NPV КАК NPV
		|ИЗ
		|	РегистрСведений.СтоимостьСПФИ КАК СтоимостьСПФИ
		|ГДЕ
		|	СтоимостьСПФИ.Период = &Период
		|	И СтоимостьСПФИ.Организация = &Организация
		|	И СтоимостьСПФИ.СПФИ = &СПФИ";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("СПФИ", СВОП);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.NPV;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт

	Движения[УчетныйРегистр].Записывать = Истина;
	
	СчетУчетаДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(	ЭтотОбъект.Дата,
																		ЭтотОбъект.Организация,
																		ЭтотОбъект.СчетДоверительногоУправления,
																		ЭтотОбъект.ВалютаОплаты,
																		ЭтотОбъект.Брокер);
																		
	Если ЭтотОбъект.РынокСПФИ Тогда
		
	Иначе	
		ВариационнаяМаржаПрибыль	= ОбщегоНазначения.ПолучитьИменованныйОбъект("МаржаПрибыль");
		ВариационнаяМаржаУбыток		= ОбщегоНазначения.ПолучитьИменованныйОбъект("МаржаУбыток");
	КонецЕсли;
	
	
	ЕстьБрокер							= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БрокерскиеКомпании) <> Неопределено;
	ЕстьДоговорыБрокерскогоОбслуживания	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ДоговорыБрокерскогоОбслуживания) <> Неопределено;
	ЕстьВидДвиженияДС					= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.ВидДвиженияДенежныхСредств) <> Неопределено;
	ЕстьРасчетныйСчет                	= СчетУчетаДС.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконто.БанковскиеСчета) <> Неопределено;
	
	Если ЕстьДоговорыБрокерскогоОбслуживания Тогда
		ДоговорБрокерскогоОбслуживания = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
	КонецЕсли;
	
	
	ТаблицаЦБ = Новый ТаблицаЗначений;
	ТаблицаЦБ.Колонки.Добавить("ЦеннаяБумага", Метаданные.ОпределяемыеТипы.ЦенныеБумаги.Тип); 
	Для Каждого СтрИнструменты Из ЭтотОбъект.Инструменты Цикл 
		НовСтрока = ТаблицаЦБ.Добавить();
		НовСтрока.ЦеннаяБумага = СтрИнструменты.Инструмент;
	КонецЦикла;	
		
	СведенияОбОбращенииЦенныхБумагНаОРЦБ = БухгалтерскийУчет.ПолучитьСведенияОбОбращенииКорзиныЦенныхБумагНаОРЦБ(ЭтотОбъект.Дата, ЭтотОбъект.Ссылка, УчетныйРегистр, , ТаблицаЦБ);	
	
	Для Каждого СтрокаИнструменты Из ЭтотОбъект.Инструменты Цикл
		
		Если ЭтотОбъект.РынокСПФИ Тогда
			
			НайденныеСведенияОбОбращенииЦенныхБумагНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(СтрокаИнструменты.Инструмент, "ЦеннаяБумага");
			
			Если ЗначениеЗаполнено(НайденныеСведенияОбОбращенииЦенныхБумагНаОРЦБ) Тогда
				ОбращаетсяНаОРЦБ = НайденныеСведенияОбОбращенииЦенныхБумагНаОРЦБ.ОбращаетсяНаОРЦБ;
			Иначе
				ОбращаетсяНаОРЦБ = Ложь;
			КонецЕсли;
			
			СчетДС = БухгалтерскийУчет.ОпределитьСчетУчетаДенежныхСредств(ЭтотОбъект.Дата,
				ЭтотОбъект.Организация,
				ЭтотОбъект.СчетДоверительногоУправления,
				ЭтотОбъект.ВалютаОплаты,
				ЭтотОбъект.Брокер);
				
			СубконтоДС = БухгалтерскийУчет.ПолучитьДоговорБрокерскогоОбслуживания(ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Брокер, ЭтотОбъект.Дата);
			
			ПараметрыПроводкиДвиженияДС = Новый Структура();
			ПараметрыПроводкиДвиженияДС.Вставить("СПФИ", СтрокаИнструменты.Инструмент);
			ПараметрыПроводкиДвиженияДС.Вставить("Контрагент", СтрокаИнструменты.Инструмент.Контрагент);
			ПараметрыПроводкиДвиженияДС.Вставить("СчетДС", СчетДС);
			ПараметрыПроводкиДвиженияДС.Вставить("УчетныйРегистр", УчетныйРегистр);
			ПараметрыПроводкиДвиженияДС.Вставить("СубконтоДС", СубконтоДС);
			ПараметрыПроводкиДвиженияДС.Вставить("Валюта", ЭтотОбъект.ВалютаОплаты);
			
			СтоимостьСВОПа = ОпределитьNPV(СтрокаИнструменты.Инструмент, НачалоДня(ЭтотОбъект.Дата));
			
			ПараметрыПроводкиДвиженияДС.Вставить("ВидДвиженияДенежныхСредств", Справочники.ВидыДвиженияДенежныхСредств.ВариационнаяМаржа);
			ПараметрыПроводкиДвиженияДС.Вставить("Описание", "Депозитная маржа");

			ДепозитнаяМаржаРасчеты = 0;
			ДепозитнаяМаржаПривлеченка = 0;
			
			Если СтрокаИнструменты.Сумма > 0 Тогда // нам пришла маржа - у нас появились привлеченные средства
				
				Если СтоимостьСВОПа <= 0 Тогда // сидим в минусах - корреспондируем с расчетами
				
					ДепозитнаяМаржаРасчеты = СтрокаИнструменты.Сумма;
					
				ИначеЕсли СтрокаИнструменты.Сумма >= СтоимостьСВОПа Тогда // приход маржи вывел NPV из минуса в плюс - часть с взаиморасчетов, часть с привлеченки
					
					ДепозитнаяМаржаРасчеты = СтрокаИнструменты.Сумма - СтоимостьСВОПа;
					ДепозитнаяМаржаПривлеченка = СтоимостьСВОПа;
					
				Иначе // мы в плюсах - все с привлеченки
					
					ДепозитнаяМаржаПривлеченка = СтрокаИнструменты.Сумма;
					
				КонецЕсли;
				
			ИначеЕсли СтрокаИнструменты.Сумма < 0 Тогда // мы отдали маржу - возник долг нам по марже (расчеты)
				
				Если СтоимостьСВОПа >= 0 Тогда // сидим в плюсах - корреспондируем с привлеченкой
				
					ДепозитнаяМаржаПривлеченка = СтрокаИнструменты.Сумма;
					
				ИначеЕсли СтрокаИнструменты.Сумма <= СтоимостьСВОПа Тогда // приход маржи вывел NPV из плюса в минус - часть с привлеченки, часть с взаиморасчетов
					
					ДепозитнаяМаржаРасчеты = СтоимостьСВОПа;
					ДепозитнаяМаржаПривлеченка = СтрокаИнструменты.Сумма - СтоимостьСВОПа;
					
				Иначе // мы в минусе - все с расчетов
					
					ДепозитнаяМаржаРасчеты = СтрокаИнструменты.Сумма;
					
				КонецЕсли;
				
			КонецЕсли;	
			
			Если ДепозитнаяМаржаРасчеты <> 0 Тогда
			
				ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", ДепозитнаяМаржаРасчеты);
				ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Основной.РазмещенныеСредстваДепозитнаяМаржа); //58.3 (58.4) //47010 ПланыСчетов.Единый.ПрочиеСредства10);
				
				СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводкиДвиженияДС);
			
			КонецЕсли;
			
			Если ДепозитнаяМаржаПривлеченка <> 0 Тогда
			
				ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", ДепозитнаяМаржаПривлеченка);
				ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Основной.ПривлеченныеСредстваДепозитнаяМаржа); //43708    ПривлеченныеСредстваФинОрг08
				
				СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводкиДвиженияДС);
			
			КонецЕсли;
			
			Если СтрокаИнструменты.Сумма > 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаИнструменты.Сумма, "Депозитная маржа");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ДепозитнаяМаржа;//76.31//52601 УчетныйАктивЕПС.СчетУчетаПереоценкиА;
				Проводка.СубконтоДт.Контрагенты = СтрокаИнструменты.Инструмент.Контрагент;
				Проводка.СубконтоДт.Сделка = СтрокаИнструменты.Инструмент;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;//71509_36204 УчетныйАктивЕПС.СчетУчетаДоходовОтОпераций;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ДепозитнаяМаржаВнереализационные");
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
				
			ИначеЕсли СтрокаИнструменты.Сумма < 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], -СтрокаИнструменты.Сумма, "Депозитная маржа");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;//71510_46204 УчетныйАктивЕПС.СчетУчетаРасходовОтОпераций;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ДепозитнаяМаржаВнереализационные");
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ДепозитнаяМаржа;//76.31//52602 УчетныйАктивЕПС.СчетУчетаПереоценкиП;
				Проводка.СубконтоКт.Контрагенты = СтрокаИнструменты.Инструмент.Контрагент;
				Проводка.СубконтоКт.Сделка = СтрокаИнструменты.Инструмент;
				
			КонецЕсли;
			
			// %ДМ
			Если СтрокаИнструменты.Процент <> 0 Тогда
			
				ПараметрыПроводкиДвиженияДС.Вставить("СуммаДвиженияДС", СтрокаИнструменты.Процент);
				Если СтрокаИнструменты.Процент > 0 Тогда
					ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Основной.ПроцентыНачисленныеНаДепозитнуюМаржу76); //47011 ПланыСчетов.Единый.ПрочиеСредства11); 
				Иначе
				    ПараметрыПроводкиДвиженияДС.Вставить("КоррСчет", ПланыСчетов.Основной.ПроцентыНачисленныеНаДепозитнуюМаржу); //43709 ПривлеченныеСредстваФинОрг09
				КонецЕсли;
				ПараметрыПроводкиДвиженияДС.Вставить("ВидДвиженияДенежныхСредств", Справочники.ВидыДвиженияДенежныхСредств.ВариационнаяМаржа);
				ПараметрыПроводкиДвиженияДС.Вставить("Описание", "Проценты на депозитную маржу");
				
				СформироватьПроводкуДвиженияДСБУНУ(ПараметрыПроводкиДвиженияДС);
			
			КонецЕсли;
			
			Если СтрокаИнструменты.Процент > 0 Тогда 
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаИнструменты.Процент, "Проценты на депозитную маржу");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПроцентыНачисленныеНаДепозитнуюМаржу76;//ПланыСчетов.Единый.ПрочиеСредства11;
				Проводка.СубконтоДт.Контрагенты = СтрокаИнструменты.Инструмент.Контрагент;
				Проводка.СубконтоДт.Сделка = СтрокаИнструменты.Инструмент;
				
				Проводка.ВалютаДт = ЭтотОбъект.ВалютаОплаты;
				Проводка.ВалютнаяСуммаДт = СтрокаИнструменты.Процент;
				
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы; //71001 ПроцентныеДоходы01
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ПроцентНаДМВнереализационные");
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
				
			ИначеЕсли СтрокаИнструменты.Процент < 0 Тогда
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], -СтрокаИнструменты.Процент, "Проценты на депозитную маржу");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;//ПланыСчетов.Единый.ПроцентныеРасходы01;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ОбщегоНазначения.ПолучитьИменованныйОбъект("ПДР_ПроцентНаДМВнереализационные");
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПроцентыНачисленныеНаДепозитнуюМаржу;// 47011 ПланыСчетов.Единый.ПривлеченныеСредстваФинОрг09;
				Проводка.СубконтоКт.Контрагенты = СтрокаИнструменты.Инструмент.Контрагент;
				Проводка.СубконтоКт.Сделка = СтрокаИнструменты.Инструмент;
				
			КонецЕсли;
			
		Иначе // фьючерсы
			
			ОбращаетсяНаОРЦБ = СведенияОбОбращенииЦенныхБумагНаОРЦБ.Найти(СтрокаИнструменты.Инструмент, "ЦеннаяБумага").ОбращаетсяНаОРЦБ;
		
			Если СтрокаИнструменты.Сумма > 0 Тогда
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаИнструменты.Сумма, "Вариационная маржа");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ВариационнаяМаржа;
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ПрочиеДоходы;
				Проводка.СубконтоКт.ПрочиеДоходыИРасходы = ВариационнаяМаржаПрибыль;
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				Проводка.СубконтоКт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], СтрокаИнструменты.Сумма, "Вариационная маржа");
				Проводка.СчетДт = СчетУчетаДС;
				Если ЕстьРасчетныйСчет Тогда 
					Проводка.СубконтоДт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
				КонецЕсли;	
				
				Если ЕстьБрокер Тогда
					Проводка.СубконтоДт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				КонецЕсли;
				
				Если ЕстьДоговорыБрокерскогоОбслуживания Тогда
					Проводка.СубконтоДт.ДоговорыБрокерскогоОбслуживания = ДоговорБрокерскогоОбслуживания;
				КонецЕсли;
				
				Если ЕстьВидДвиженияДС Тогда 
					Проводка.СубконтоДт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВариационнаяМаржа;
				КонецЕсли;	
				
				Проводка.СчетКт = ПланыСчетов.Основной.ВариационнаяМаржа;
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				
				
			ИначеЕсли СтрокаИнструменты.Сумма < 0 Тогда
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], - СтрокаИнструменты.Сумма, "Вариационная маржа");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ПрочиеРасходы;
				Проводка.СубконтоДт.ПрочиеДоходыИРасходы = ВариационнаяМаржаУбыток;
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				Проводка.СубконтоДт.ОбращаетсяНаОРЦБ = ОбращаетсяНаОРЦБ;
				
				Проводка.СчетКт = ПланыСчетов.Основной.ВариационнаяМаржа;
				Проводка.СубконтоКт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				
				
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], - СтрокаИнструменты.Сумма, "Вариационная маржа");
				
				Проводка.СчетДт = ПланыСчетов.Основной.ВариационнаяМаржа;
				Проводка.СубконтоДт.ЦенныеБумаги = СтрокаИнструменты.Инструмент;
				
				Проводка.СчетКт = СчетУчетаДС;
				Если ЕстьРасчетныйСчет Тогда 
					Проводка.СубконтоКт.БанковскиеСчета = ЭтотОбъект.РасчетныйСчет;
				КонецЕсли;	
				
				Если ЕстьБрокер Тогда
					Проводка.СубконтоКт.БрокерскиеКомпании = ЭтотОбъект.Брокер;
				КонецЕсли;
				
				Если ЕстьДоговорыБрокерскогоОбслуживания Тогда
					Проводка.СубконтоКт.ДоговорыБрокерскогоОбслуживания = ДоговорБрокерскогоОбслуживания;
				КонецЕсли;
				
				Если ЕстьВидДвиженияДС Тогда 
					Проводка.СубконтоКт.ВидДвиженияДенежныхСредств = Справочники.ВидыДвиженияДенежныхСредств.ВариационнаяМаржа;
				КонецЕсли;	
				
			КонецЕсли;
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	// заполним связанные поля
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ВалютаОплаты) Тогда
		ЭтотОбъект.ВалютаОплаты = ЭтотОбъект.Организация.ВалютаУчета;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	ЭтотОбъект.Сумма = Инструменты.Итог("Сумма");
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;

	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		РаботаСДокументами.ПроверитьЗаполнениеРасчетногоСчета(ЭтотОбъект, Отказ);
		
		ВыбраныеИнструменты = Новый Соответствие;
		
		Для НомСтр = 0 По ЭтотОбъект.Инструменты.Количество() - 1 Цикл
			СтрокаИнструменты = ЭтотОбъект.Инструменты[НомСтр];
			
			Если ВыбраныеИнструменты.Получить(СтрокаИнструменты.Инструмент) = Неопределено Тогда
				ВыбраныеИнструменты.Вставить(СтрокаИнструменты.Инструмент, Строка(НомСтр + 1));
			Иначе
				ВыбраныеИнструменты.Вставить(СтрокаИнструменты.Инструмент, ВыбраныеИнструменты.Получить(СтрокаИнструменты.Инструмент) + ", " + Строка(НомСтр + 1));
			КонецЕсли;
			
		КонецЦикла;	
		
		Для Каждого ВыбранныйИнструмент Из ВыбраныеИнструменты Цикл
			Если Найти(ВыбранныйИнструмент.Значение, ",") > 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фьючерс """ + ВыбранныйИнструмент.Ключ + """ встречается в документе несколько раз, в строках: " + ВыбранныйИнструмент.Значение,,,, Отказ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСЖурналамиОпераций.ПередЗаписьюДокумента(ЭтотОбъект);	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ОбработкаПроведения

#КонецОбласти
